results/data/benchclient1/quarkus-io-thread-60000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.122ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.120ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.117ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.126ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  505.47us   3.69ms   64.41%
    Req/Sec    15.82k     0.99k   20.56k    72.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.48ms
 90.000%    1.81ms
 99.000%    2.31ms
 99.900%    2.72ms
 99.990%    3.03ms
 99.999%    3.25ms
100.000%    3.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.047     0.000000            1         1.00
       0.479     0.100000       299831         1.11
       0.643     0.200000       600282         1.25
       0.790     0.300000       898517         1.43
       0.933     0.400000      1197019         1.67
       1.079     0.500000      1497815         2.00
       1.153     0.550000      1645958         2.22
       1.230     0.600000      1796672         2.50
       1.309     0.650000      1945710         2.86
       1.392     0.700000      2095765         3.33
       1.480     0.750000      2245709         4.00
       1.526     0.775000      2319173         4.44
       1.576     0.800000      2395201         5.00
       1.627     0.825000      2468883         5.71
       1.683     0.850000      2543546         6.67
       1.745     0.875000      2619202         8.00
       1.778     0.887500      2656101         8.89
       1.814     0.900000      2693891        10.00
       1.852     0.912500      2730984        11.43
       1.893     0.925000      2768021        13.33
       1.940     0.937500      2805597        16.00
       1.966     0.943750      2824707        17.78
       1.993     0.950000      2842925        20.00
       2.024     0.956250      2861975        22.86
       2.057     0.962500      2880318        26.67
       2.095     0.968750      2899141        32.00
       2.117     0.971875      2908890        35.56
       2.139     0.975000      2917672        40.00
       2.165     0.978125      2926985        45.71
       2.195     0.981250      2936412        53.33
       2.229     0.984375      2945704        64.00
       2.249     0.985938      2950370        71.11
       2.271     0.987500      2954995        80.00
       2.295     0.989062      2959652        91.43
       2.323     0.990625      2964349       106.67
       2.357     0.992188      2969052       128.00
       2.377     0.992969      2971431       142.22
       2.397     0.993750      2973679       160.00
       2.421     0.994531      2976035       182.86
       2.449     0.995313      2978384       213.33
       2.483     0.996094      2980690       256.00
       2.505     0.996484      2981919       284.44
       2.525     0.996875      2983009       320.00
       2.549     0.997266      2984163       365.71
       2.577     0.997656      2985368       426.67
       2.611     0.998047      2986558       512.00
       2.629     0.998242      2987113       568.89
       2.649     0.998437      2987670       640.00
       2.675     0.998633      2988278       731.43
       2.699     0.998828      2988845       853.33
       2.729     0.999023      2989453      1024.00
       2.745     0.999121      2989741      1137.78
       2.761     0.999219      2990004      1280.00
       2.783     0.999316      2990305      1462.86
       2.805     0.999414      2990595      1706.67
       2.831     0.999512      2990881      2048.00
       2.847     0.999561      2991033      2275.56
       2.861     0.999609      2991171      2560.00
       2.879     0.999658      2991327      2925.71
       2.899     0.999707      2991471      3413.33
       2.919     0.999756      2991615      4096.00
       2.935     0.999780      2991691      4551.11
       2.951     0.999805      2991758      5120.00
       2.965     0.999829      2991837      5851.43
       2.981     0.999854      2991904      6826.67
       3.005     0.999878      2991977      8192.00
       3.015     0.999890      2992017      9102.22
       3.029     0.999902      2992047     10240.00
       3.045     0.999915      2992085     11702.86
       3.063     0.999927      2992121     13653.33
       3.081     0.999939      2992162     16384.00
       3.091     0.999945      2992180     18204.44
       3.099     0.999951      2992195     20480.00
       3.113     0.999957      2992212     23405.71
       3.125     0.999963      2992230     27306.67
       3.143     0.999969      2992248     32768.00
       3.165     0.999973      2992257     36408.89
       3.175     0.999976      2992267     40960.00
       3.183     0.999979      2992276     46811.43
       3.199     0.999982      2992285     54613.33
       3.219     0.999985      2992295     65536.00
       3.227     0.999986      2992298     72817.78
       3.239     0.999988      2992305     81920.00
       3.243     0.999989      2992308     93622.86
       3.263     0.999991      2992312    109226.67
       3.277     0.999992      2992317    131072.00
       3.301     0.999993      2992319    145635.56
       3.315     0.999994      2992321    163840.00
       3.325     0.999995      2992324    187245.71
       3.339     0.999995      2992326    218453.33
       3.343     0.999996      2992328    262144.00
       3.367     0.999997      2992329    291271.11
       3.375     0.999997      2992330    327680.00
       3.403     0.999997      2992332    374491.43
       3.421     0.999998      2992333    436906.67
       3.427     0.999998      2992334    524288.00
       3.427     0.999998      2992334    582542.22
       3.429     0.999998      2992335    655360.00
       3.487     0.999999      2992336    748982.86
       3.487     0.999999      2992336    873813.33
       3.509     0.999999      2992337   1048576.00
       3.509     0.999999      2992337   1165084.44
       3.509     0.999999      2992337   1310720.00
       3.533     0.999999      2992338   1497965.71
       3.533     0.999999      2992338   1747626.67
       3.533     1.000000      2992338   2097152.00
       3.533     1.000000      2992338   2330168.89
       3.533     1.000000      2992338   2621440.00
       3.691     1.000000      2992339   2995931.43
       3.691     1.000000      2992339          inf
#[Mean    =        1.117, StdDeviation   =        0.505]
#[Max     =        3.690, Total count    =      2992339]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3596195 requests in 1.00m, 178.34MB read
Requests/sec:  59937.27
Transfer/sec:      2.97MB