results/data/benchclient1/quarkus-worker-pool-40000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.476ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.466ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.471ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.425ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39ms  639.32us  10.68ms   68.59%
    Req/Sec    10.53k     0.85k   18.40k    74.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.32ms
 75.000%    1.80ms
 90.000%    2.22ms
 99.000%    3.14ms
 99.900%    4.18ms
 99.990%    7.57ms
 99.999%    9.27ms
100.000%   10.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.108     0.000000            1         1.00
       0.627     0.100000       199549         1.11
       0.829     0.200000       399547         1.25
       0.994     0.300000       599269         1.43
       1.151     0.400000       798173         1.67
       1.316     0.500000       998649         2.00
       1.403     0.550000      1097582         2.22
       1.495     0.600000      1197850         2.50
       1.592     0.650000      1297251         2.86
       1.695     0.700000      1396979         3.33
       1.802     0.750000      1496353         4.00
       1.859     0.775000      1546718         4.44
       1.918     0.800000      1596189         5.00
       1.981     0.825000      1645846         5.71
       2.051     0.850000      1695712         6.67
       2.131     0.875000      1746244         8.00
       2.175     0.887500      1770770         8.89
       2.223     0.900000      1795921        10.00
       2.277     0.912500      1821160        11.43
       2.337     0.925000      1846104        13.33
       2.405     0.937500      1870402        16.00
       2.445     0.943750      1883307        17.78
       2.487     0.950000      1895358        20.00
       2.537     0.956250      1907924        22.86
       2.593     0.962500      1920199        26.67
       2.663     0.968750      1932744        32.00
       2.705     0.971875      1938998        35.56
       2.749     0.975000      1945208        40.00
       2.803     0.978125      1951495        45.71
       2.865     0.981250      1957557        53.33
       2.945     0.984375      1963841        64.00
       2.991     0.985938      1966934        71.11
       3.045     0.987500      1970102        80.00
       3.101     0.989062      1973132        91.43
       3.173     0.990625      1976281       106.67
       3.251     0.992188      1979350       128.00
       3.295     0.992969      1980924       142.22
       3.341     0.993750      1982520       160.00
       3.393     0.994531      1984026       182.86
       3.455     0.995313      1985594       213.33
       3.525     0.996094      1987137       256.00
       3.563     0.996484      1987917       284.44
       3.607     0.996875      1988700       320.00
       3.657     0.997266      1989478       365.71
       3.715     0.997656      1990260       426.67
       3.789     0.998047      1991044       512.00
       3.837     0.998242      1991435       568.89
       3.893     0.998437      1991816       640.00
       3.967     0.998633      1992202       731.43
       4.059     0.998828      1992596       853.33
       4.199     0.999023      1992980      1024.00
       4.307     0.999121      1993176      1137.78
       4.451     0.999219      1993377      1280.00
       4.647     0.999316      1993567      1462.86
       4.931     0.999414      1993760      1706.67
       5.243     0.999512      1993957      2048.00
       5.439     0.999561      1994052      2275.56
       5.719     0.999609      1994149      2560.00
       5.935     0.999658      1994247      2925.71
       6.207     0.999707      1994344      3413.33
       6.443     0.999756      1994441      4096.00
       6.627     0.999780      1994491      4551.11
       6.815     0.999805      1994540      5120.00
       6.959     0.999829      1994588      5851.43
       7.127     0.999854      1994638      6826.67
       7.375     0.999878      1994685      8192.00
       7.479     0.999890      1994711      9102.22
       7.591     0.999902      1994734     10240.00
       7.795     0.999915      1994758     11702.86
       7.991     0.999927      1994782     13653.33
       8.191     0.999939      1994807     16384.00
       8.311     0.999945      1994819     18204.44
       8.415     0.999951      1994833     20480.00
       8.463     0.999957      1994843     23405.71
       8.575     0.999963      1994856     27306.67
       8.727     0.999969      1994869     32768.00
       8.847     0.999973      1994874     36408.89
       8.919     0.999976      1994880     40960.00
       9.007     0.999979      1994886     46811.43
       9.063     0.999982      1994892     54613.33
       9.143     0.999985      1994899     65536.00
       9.167     0.999986      1994902     72817.78
       9.199     0.999988      1994905     81920.00
       9.255     0.999989      1994907     93622.86
       9.303     0.999991      1994910    109226.67
       9.383     0.999992      1994913    131072.00
       9.391     0.999993      1994915    145635.56
       9.399     0.999994      1994916    163840.00
       9.479     0.999995      1994918    187245.71
       9.511     0.999995      1994919    218453.33
       9.551     0.999996      1994921    262144.00
      10.079     0.999997      1994922    291271.11
      10.079     0.999997      1994922    327680.00
      10.207     0.999997      1994923    374491.43
      10.263     0.999998      1994924    436906.67
      10.431     0.999998      1994925    524288.00
      10.431     0.999998      1994925    582542.22
      10.431     0.999998      1994925    655360.00
      10.503     0.999999      1994926    748982.86
      10.503     0.999999      1994926    873813.33
      10.623     0.999999      1994927   1048576.00
      10.623     0.999999      1994927   1165084.44
      10.623     0.999999      1994927   1310720.00
      10.623     0.999999      1994927   1497965.71
      10.623     0.999999      1994927   1747626.67
      10.687     1.000000      1994928   2097152.00
      10.687     1.000000      1994928          inf
#[Mean    =        1.390, StdDeviation   =        0.639]
#[Max     =       10.680, Total count    =      1994928]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2397539 requests in 1.00m, 210.36MB read
Requests/sec:  39959.06
Transfer/sec:      3.51MB