results/data/benchclient1/quarkus-worker-pool-42000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 3.891ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 3.881ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 3.870ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 3.867ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.63ms    5.46ms  41.86ms   88.30%
    Req/Sec    10.74k     3.03k   26.00k    79.07%
  2517459 requests in 1.00m, 220.88MB read
Requests/sec:  41957.29
Transfer/sec:      3.68MB